Repository: TechnoServe/SprayerApp-Mobile
Catalog: lib/l10n/app_*.arb
Languages: pt

# choose_your_language
source: Select your language
pt: Seleccione seu idioma

# general_modal_exitform_confirmation_title
source: Exit form
pt: Sair do formulario

# general_modal_exitform_confirmation
source: Are you sure, you want exit the form?
pt: Tem certeza que deseja sair do formulario?

# general_modal_exitform_confirmation_yes
source: Yes
pt: Sim

# general_modal_exitform_confirmation_no
source: No
pt: Não

# general_loading_message
source: Please wait...
pt: Por favor aguarde...

# general_total_returned_message
source: Returned a total of {total} result(s)
pt: Retornou um total de {total} resultado(s)

# general_total_registered_trees_message
source: {total} registered tree(s)
pt: {total} arvore(s) registadas

# general_trees_sprayed_message
source: {total} sprayed tree(s)
pt: {total} arvores pulverizadas

# general_trees_cleaned_message
source: {total} cleaned tree(s)
pt: {total} arvores limpas

# general_trees_pruned_message
source: {total} pruned tree(s)
pt: {total} arvores podadas

# general_success_save_form_message
source: Form successfully saved
pt: Formulario salvo com sucesso

# general_failed_save_form_message
source: Failed to save form
pt: Erro ao salvar formulario

# general_error_occured_save_message
source: An error occured {error}
pt: Ocorreu um erro {error}, ao salvar o formulario

# general_registered_farmers_message
source: Registered farmers
pt: Produtores registados

# general_assisted_farmers_message
source: Assisted farmers
pt: Produtores assistidos

# general_registered_plantation_message
source: Registered plots
pt: Plantações registadas

# general_registered_trees_message
source: Registered trees
pt: Arvores registadas

# general_cleaned_trees_message
source: Cleaned trees
pt: Arvores limpas

# general_pruned_trees_message
source: Pruned trees
pt: Arvores podadas

# general_set_agreement_message
source: No payment agreement
pt: Sem acordo de pagamento

# general_agreement_payment_fully_paid_message
source: Farmer has fully paid the debit
pt: Produtor sem divida

# general_agreement_payment_over_paid_message
source: The collected amount is greater than the debit
pt: O valor pago é superior a divida

# general_profit_per_tree_per_sprayer_message
source: Profit per atomizer
pt: Lucro por atomizador

# general_cost_per_tree_per_sprayer_message
source: Cost per tree
pt: Custo por arvore

# general_refresh
source: Refresh page
pt: Actualizar pagina

# general_search
source: Search
pt: Pesquisar

# general_farmers_entity
source: Farmers
pt: Produtores

# general_plots_entity
source: Plots
pt: Plantações

# general_tress_entity
source: trees
pt: Arvores

# general_agreed_tress_entity
source: Agreed trees
pt: Arvores acordadas

# general_applications_entity
source: Applications
pt: Aplicações

# general_debit_entity
source: Debit
pt: Em divida

# general_expenses_overview
source: Expenses overview
pt: Despesas

# general_incomes_overview
source: Incomes overview
pt: Receitas

# general_total_expenses
source: Total expenses
pt: Despesas totais

# general_total_incomes
source: Total incomes
pt: Receitas totais

# general_trees_sprayed_per_application
source: Trees sprayed per application
pt: Arvores pulverizadas por aplicação

# login_title
source: Inform your credentials
pt: Informe suas credencias

# recover_password_title
source: Reset password
pt: Recuperar senha

# signup_title
source: Fill the form to get registered
pt: Preencha o formulario para se registar

# login_username_placeholder
source: Mobile number or email
pt: Número de Telefone ou email

# login_password_placeholder
source: Password
pt: Senha

# login_button
source: Signin
pt: Entrar

# login_successful
source: Logged in successfully
pt: Autenticado com sucesso

# login_unsuccessful_error
source: Failed to login
pt: Erro ao autenticar

# signin_call_to_action
source: Already have an account?
pt: Ja tem uma conta criada?

# signin_recover_password_call_to_action_text
source: Forgot your password?
pt: Esqueceu sua senha?

# signin_recover_password_text
source: Clique here to reset
pt: clique para recuperar

# signin_button_text
source: Please signin
pt: clique para entrar

# signup_call_to_action
source: Don't have an account?
pt: Ainda não tem conta?

# signup_button_text
source: Please signup
pt: clique para registar-se

# recover_safety_question_placeholder
source: Safety question
pt: Pergunta de segurança

# recover_safety_answer_placeholder
source: Answer
pt: Resposta

# recover_new_password_placeholder
source: New password
pt: Nova senha

# recover_repeat_new_password_placeholder
source: Repeat password
pt: Repetir senha

# recover_dont_match_password_placeholder
source: Password does not match
pt: As senhas não correspondem

# settings_title
source: Settings
pt: Definições

# settings_darkmode_toggle
source: Dark theme
pt: Tema escuro

# settings_changelanguage_selection
source: Change language
pt: Mudar idioma

# settings_accountdetails_edit
source: Update account
pt: Actualizar conta

# settings_campaign_managment
source: Campaign managment
pt: Gestão de campanhas

# settings_database_backup
source: Database backup
pt: Backup da base de dados

# settings_contact_support
source: Contact support
pt: Suporte tecnico

# settings_about
source: About us
pt: Sobre nos

# form_field_free_input_value
source: Free
pt: Gratuito

# form_field_buy_input_value
source: Buy
pt: Comprado

# form_field_operational_input_value
source: Operational
pt: Operacional

# form_field_non_operational_input_value
source: Non operational
pt: Não operacional

# form_field_atomizer_input_value
source: Atomizer
pt: Atomizador

# form_field_expense_input_value
source: Expense
pt: Despesa

# form_field_income_input_value
source: Income
pt: Receita

# form_field_employees_input_value
source: Employees
pt: Trabalhadores

# form_field_fuels_input_value
source: Fuels
pt: Combustivel

# form_field_equipment_maintenance_input_value
source: Equipment maintenance
pt: Manutenção de Equipamento

# form_field_equipment_acquisition_input_value
source: Equipment acquisition
pt: Compra de Equipamento

# form_field_cleaning_and_pruning_input_value
source: Cleaning and Pruning
pt: Limpeza e Poda

# form_field_cleaning_input_value
source: Cleaning
pt: Limpeza

# form_field_pruning_input_value
source: Pruning
pt: Poda

# form_field_mandatory_validation_message
source: This field is mandatory
pt: Este campo é obrigatorio

# form_field_check_all_mandatory_fields_validation_message
source: Check all mandatory fields
pt: Verifique todos campos mandatorios

# access_denied_validation_message
source: Access Denied
pt: Acesso não permitido

# form_field_exceeded_validation_message
source: Exceeded the total of {numberOfTrees} trees of the farmer
pt: Excedeu o numero de {numberOfTrees} arvores do produtor

# form_field_firstname_placeholder
source: Firstname
pt: Primeiro nome

# form_field_plotname_placeholder
source: Plot name
pt: Nome da plantação

# form_field_number_of_large_trees_placeholder
source: Number of large trees
pt: Numero de arvores grandes

# form_field_number_of_small_trees_placeholder
source: Number of small trees
pt: Numero de arvores pequenas

# form_field_declared_area_placeholder
source: Declared area (ha)
pt: Area declarada (ha)

# form_field_lastname_placeholder
source: Lastname
pt: Apelido

# form_field_mobile_number_placeholder
source: Mobile number
pt: Número de telefone

# form_field_birth_date_placeholder
source: Birth date
pt: Data de nascimento

# form_field_birth_year_placeholder
source: Birth year
pt: Ano de nascimento

# form_field_gender_placeholder
source: Gender
pt: Genero

# form_field_province_placeholder
source: Province
pt: Provincia

# form_field_district_placeholder
source: District
pt: Distrito

# form_field_pruning_type_placeholder
source: Pruning type
pt: Tipo de poda

# form_field_plot_type_placeholder
source: Plot Type
pt: Tipo de Plantação

# form_field_other_crop_placeholder
source: Other Crop
pt: Outra cultura

# form_field_administrativepost_placeholder
source: Administrative post
pt: Posto Administrativo

# form_field_password_placeholder
source: Password
pt: Senha

# form_field_price_placeholder
source: Cost
pt: Valor

# form_field_total_price_placeholder
source: Total cost
pt: Valor total

# form_field_quantity_placeholder
source: Quantity
pt: Quantidade

# form_field_collected_amount_placeholder
source: Collected amount
pt: Valor pago

# form_field_discount_placeholder
source: Discount
pt: Desconto

# form_field_category_placeholder
source: Category
pt: Categoria

# form_field_transaction_type_placeholder
source: Transaction type
pt: Tipo de transacção

# form_field_payment_type_placeholder
source: Payment type
pt: Tipo de pagamento

# form_field_description_placeholder
source: Description
pt: Descrição

# form_field_agreed_trees_to_spray_placeholder
source: Number of trees agreed
pt: Numero de arvores acordadas

# form_field_sprayed_date_placeholder
source: Sprayed date
pt: Data da pulverização

# form_field_payment_per_tree_placeholder
source: Payment per large trees
pt: Pagamento por arvores grandes

# form_field_payment_per_small_tree_placeholder
source: Payment per small trees
pt: Pagamento por arvores pequenas

# form_field_number_of_applications_placeholder
source: Number of applications
pt: Numero de aplicações

# form_field_how_did_you_get_chemicals_placeholder
source: How did you get the chemicals
pt: Como adiquiriu os quimicos

# form_field_supplier_placeholder
source: Suppliers
pt: Fornecedores

# form_field_chemical_name_placeholder
source: Chemical name
pt: Nome do quimico

# form_field_acquired_date_placeholder
source: Acquired date
pt: Data de aquisição

# form_field_number_of_trees_sprayed_placeholder
source: Number of large trees
pt: Numero de arvores grandes

# form_field_number_of_trees_small_sprayed_placeholder
source: Number of small trees
pt: Numero de arvores pequenas

# form_field_number_of_trees_cleaned_placeholder
source: Number of trees cleaned
pt: Numero de arvores limpas

# form_field_number_of_trees_pruned_placeholder
source: Number of trees pruned
pt: Numero de arvores podadas

# form_field_equipment_name_placeholder
source: Equiment name
pt: Nome do equipamento

# form_field_brand_placeholder
source: Brand
pt: Marca

# form_field_buyed_year_placeholder
source: Bought year
pt: Ano de compra

# form_field_buyed_at_placeholder
source: Bought in
pt: Comprado em

# form_field_model_placeholder
source: Model
pt: Modelo

# form_field_status_placeholder
source: Status
pt: Estado

# form_field_atomizer_placeholder
source: Atomizer
pt: Atomizador

# form_field_button_save_text
source: Save
pt: Salvar

# form_field_button_register_transaction
source: Register transaction
pt: Registar transacção

# form_field_button_register
source: Register
pt: Registar

# form_field_no_event_activity
source: No Activity registered
pt: Nenhuma actividade registada

# form_field_event_activity
source: Schedule activity
pt: Agendar actividades

# form_field_event_activity_title_placeholder
source: Activity title
pt: Titulo da actividade

# form_field_event_from_date_placeholder
source: Start date
pt: Data de Inicio

# form_field_event_end_date_placeholder
source: End date
pt: Data de final

# sidebar_modules_farmersandplots
source: Farmers and plots
pt: Produtores e plantações

# sidebar_modules_finance
source: Finance
pt: Finanças

# sidebar_modules_chemicalacquisition
source: Chemical acquisition
pt: Acquisição de quimicos

# sidebar_modules_chemicaltreatment
source: Integrated managment
pt: Maneio integrado

# sidebar_modules_schedule_activity
source: Schedule activities
pt: Agendar actividades

# sidebar_modules_equipments
source: Equipments
pt: Equipamentos

# sidebar_modules_faq
source: FAQ's
pt: Perguntas frequentes

# search_farmers
source: Search farmer
pt: Pesquisar produtores

# register_farmers
source: Register farmer
pt: Registar produtor

# save_farmers
source: Save farmer
pt: Salvar produtor

# edit_farmers
source: Edit farmer
pt: Editar produtor

# fill_farmer_details
source: Infrom farmer details
pt: Infrome os dados do produtor

# register_plots
source: Register plot
pt: Registar plantação

# save_plots
source: Save plot
pt: Salvar plantação

# fill_plot_details
source: Inform plot details
pt: Infrome os dados da plantação

# finance_title_page
source: Finance
pt: Finanças

# finance_payment_agreement
source: Payment agreement
pt: Acordos de pagamento

# finance_payments
source: Payments
pt: Pagamentos

# finance_expenses_and_incomes
source: Expenses and incomes
pt: Receitas e despesas

# finance_reports
source: Financial reports
pt: Relatorio financeiro

# finance_profitability_reports
source: Financial profitability reports
pt: Relatorio de projeção financeira

# finance_profitability_incomes
source: Total profit
pt: Lucro total

# finance_profitability_expense
source: Expected spraying cost
pt: Custo pulverização

# finance_no_agreement
source: No agreement
pt: Sem acordo

# finance_payments_title
source: Payments
pt: Pagamentos

# finance_payments_to_pay
source: To pay
pt: Total a pagar

# finance_payments_total_debit
source: Debit
pt: Em divida

# finance_payments_total_paid
source: Total paid
pt: Total pago

# chemical_acquisition_title
source: Chemical acquisition
pt: Aquisição de quimicos

# chemical_integrated_managment_title
source: Integrated managment
pt: Maneio integrado

# chemical_integrated_managment_preparatory_activity
source: Preparatory activity
pt: Actividades preparatorias

# chemical_integrated_managment_preparatory_activity_history
source: Transaction history
pt: Historico das transacções

# chemical_integrated_managment_first_application
source: First application
pt: Primeira aplicação

# chemical_integrated_managment_second_application
source: Second application
pt: Segunda aplicação

# chemical_integrated_managment_third_application
source: Third application
pt: Terceira aplicação

# chemical_integrated_managment_chemical_application_transaction
source: Transaction history
pt: Historico das transacções

# events_number_of_farmers_and_trees_assisted
source: Assist {numberOfFarmers} farmers and {numberOfTress} trees
pt: Assistir {numberOfFarmers} produtores e {numberOfTress} arvores

# events_number_of_selected_farmers
source: {numberOfFarmers} farmer(s) selected
pt: {numberOfFarmers} produtore(s) seleccionados

# chemical_equipments_title
source: Equipments
pt: Equipamentos

# faq_title
source: FAQ's
pt: Perguntas frequentes
